#buttons
LANG_BUTTONS = ["🇺🇿", "🇷🇺"]

MAIN_BUTTONS = {
    "menu" : {
        "uz" : "📁 Каталог",
        "ru" : "📁 Каталог"
    },
    "orders" : {
        "uz" : "🛒 Саватча",
        "ru" : "🛒 Корзина"
    },
    "contact" : {
        "uz" : "☎️ Контакт маълумотлар",
        "ru" : "☎️ Наши контактные данные"
    },
    "settings" : {
        "uz" : "⚙️ Созламалар",
        "ru" : "⚙️ Настройки"        
    }
}

BACK_BUTTON = {
    "uz" : "⬅️ Орқага",
    "ru" : "⬅️ Назад"
}

CONTACT_BUTTON = {
    "uz" : "📲Телефон рақамини юбориш.", 
    "ru" : "📲Отправить номер"
}

SETTINGS_BUTTONS = {
    "name" : {
        "uz" : "📰 Исмини ўзгартириш",
        "ru" : "📰 Измените свое имя"
    },
    "phone" : {
        "uz" : "📱 Рақамни ўзгартириш",
        "ru" : "📱 Измените свое номер"
    },
    "lang" : {
        "uz" : "🇷🇺 Тилни ўзгартириш 🇺🇿",
        "ru" : "🇷🇺 Изменить язык 🇺🇿"
    }
}

BASCET_BUTTON = {
    "uz" : "🛒 Саватчага қўшиш",
    "ru" : "🛒 В корзину"
}

CLEAR_BUTTON = {
    "uz" : "🔄 Саватчани тозалаш",
    "ru" : "🔄 Очистите корзину"
}

SEND_ADMIN_BUTTON = {
    "uz" : "🚚 Буюртмани менежерга юбориш",
    "ru" : "🚚 Отправьте заказ менеджеру"
}




#Language contents

SELECT_LANGUAGE = {
    "uz" : "🇺🇿 Ботимизга Хуш келибсиз.\n\nСиз учун қулай бўлган интерфейс тилини танланг",
    "ru" : "🇷🇺 Добро пожаловать в наш бот.\n\nВыберите удобный для вас язык интерфейса."
}

GREETINGS_NAME = {
    "uz" : "Танишиб олайлик!🤗Исмингиз ва фамилиянгизни киритинг.",
    "ru" : "Давайте знакомиться!🤗Введите свое имя и фамилию."
}

GREETINGS_PHONE = {
    "uz" : "📱Телефон рақамингизни +998  *** **** форматда юборинг",
    "ru" : "📱Отправьте номер телефона для звонков в формате: +998  *** ****"
}

GREETINGS_COMPANY = {
    "uz" : "🏢Компаниянгиз номини киритинг",
    "ru" : "🏢Введите название вашей компании"
}


MAIN_MENU = {
    "uz" : "<b>🏠 Бош меню</b>",
    "ru" : "<b>🏠 Главное меню</b>"
}

MENU_CATALOG_SELECTION = {
    "uz" : "🛒 Маҳсулотлар кўрсатиш учун тегишли бўлимни танланг:",
    "ru" : "🛒 Выберите соответствующий раздел для отображения продуктов:"
}

NO_MENU_CATALOG = {
    "uz" : "🛒 Ҳозрча каталог мавжуд емас.",
    "ru" : "🛒 В настоящее время нет доступных каталогов."
}

CONTACT_US = {
    "uz" : '''📲 Телефон: <b>+99897 752 88 08, +99871 250 19 20</b>
✉️ Электрон почта: <b>info@virtustricot.uz</b>\n🕹 Манзил: <b>Toshkent, Sergili tumani, Oltin vodiy ko'cha, 60 - uy</b>
📍 Мўлжал: <b>Aeraport 3, Petrol A3C</b>''',
    "ru" : '''📲 Телефон: <b>+99897 752 88 08, +99871 250 19 20</b>
✉️ Электронное почта: <b>info@virtustricot.uz</b>\n🕹 Адрес: <b>Ташкент, Сергелийский район, улица Олтин водий, 60</b>    
Ориентир: <b>Аэропорт 3, Petrol АЗС</b>''',
}


MENU_SETTINGS_SELECTION = {
    "uz" : "🔧 Ўзгартирмоқчи бўлган созламаларни танланг:",
    "ru" : "🔧 Выберите настройки, которые хотите изменить:"
}


MENU_SETTINGS_NAME_SELECTION = {
    "uz" : f"📰 Хозирги исмингиз: <b>name</b>\nИсмингизни юборинг:",
    "ru" : f"📰 Ваше текущее имя: <b>name</b>\nОтправьте свое имя:"
}

MENU_SETTINGS_PHONE_SELECTION = {
    "uz" : f"📱 Хозирги рақамингиз: <b>phone</b>\n\nТелефон рақамингизни +998 ** *** **** форматда юборинг",
    "ru" : f"📱 Ваш текущий номер: <b>phone</b>\n\nОтправьте свой номер телефона в формате 998  *** ****"
}

MENU_SETTINGS_LANG_SELECTION = {
    "uz" : f"🌐 Хозирги тил: <b>lang</b>",
    "ru" : f"🌐 Текущий язык:: <b>lang</b>"
}

EDIT_LANG = {
    "uz" : "🇺🇿 Сиз учун қулай бўлган интерфейс тилини танланг",
    "ru" : "🇷🇺 Выберите удобный для вас язык интерфейса."
}

SUCCESSFUL_CHANGED = {
    "uz" : "<b>Ўзгартириш муваффақиятли сақланди</b>",
    "ru" : "<b>Изменение было успешно сохранено</b>"
}

NO_PRODUCT = {
    "uz" : "❗️ Ҳозирча маҳсулот мавжуд эмас",
    "ru" : "❗️ Нет товаров в наличии"
}


PRODUCT_SEND_ADMIN = {
    "uz" : "📤 Буюртмангиз менежерга юборилди, тез орада сиз билан боғланамиз",
    "ru" : "📤 Ваш заказ отправлен менеджеру, мы с Вами свяжемся в ближайшее время"
}

BASCET_CLEARED = {
    "uz" : "🔴 Саватча тозаланди",
    "ru" : "🔴 Корзина очищена"
}

BASCET_EMPTY = {
    "uz" : "🔘 Саватча ҳозирча бўш",
    "ru" : "🔘 В настоящее время корзина пуста"

}

USER_ORDERS = {
    "uz" : "🛍 Xаридлар",
    "ru" : "🛍 Покупки"
}

ORDER_ADDED_TO_BASCET = {
    "uz" : "🗑 Саватчада бор",
    "ru" : "🗑 В наличии в корзине"
}

NOW_ADDED_TO_BASCET = {
    "uz" : "🗑 Саватчага қўшилди",
    "ru" : "🗑 Добавлено в корзину"
}

FIRST_PAGE = {
    "uz" : "✅ Бу бош саҳифа",
    "ru" : "✅ Это домашняя страница"
}

LAST_PAGE = {
    "uz" : "⭕️ Бу оҳирги саҳифа",
    "ru" : "⭕️ Это последняя страница"
}

